# Lecture: Data Management and Databases

In this lecture you will learn how to create and populate a relational database. After it is created, we will walk through the different strategies you can use to pull data from the database across its multiple tables. In this demonstration, we will use Python's sqlite3 library and pandas to write SQL calls.

## Connect to the Data and Create a Database

Mount Google Drive as the storage location.

In [0]:
from google.colab import drive
drive.mount("/content/gdrive", force_remount=True)

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&response_type=code&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly

Enter your authorization code:
··········
Mounted at /content/gdrive

Establish a database called lecture.db using the sqlite3 python module.

In [0]:
import sqlite3 #the sqlite3 library allows you to write SQL queries using Python

conn = sqlite3.connect('lecture.db') #establish the database and connect to it
cursor = conn.cursor() #create a cursor for the db. cursors allow you to retrieve, add, and remove individual database records when using sqlite3 functions.

This data is currently organized in seperate csv files. CSV (comma seperated value) files are tabular data structures (spreadsheets) created in a plain text format. We will need to combine these csv files into our database, but first these csv files need to be brought into Python using the Pandas pd.read_csv function.

In [0]:
import pandas as pd #the pandas library will handle the csvs

#create variables to store csvs that will make up the database
proceedure_events = pd.read_csv("/content/gdrive/My Drive/[YCMI_CBDS Summer Course] Data/mimic_iii/PROCEDURES_ICD.csv") #this command uses pandas to read in the csv file from its location on the mounted google drive
patients = pd.read_csv("/content/gdrive/My Drive/[YCMI_CBDS Summer Course] Data/mimic_iii/PATIENTS.csv") #this is repeated for each of the csvs we want to work with
icu_stays = pd.read_csv("/content/gdrive/My Drive/[YCMI_CBDS Summer Course] Data/mimic_iii/ICUSTAYS.csv")
microbiology_events = pd.read_csv("/content/gdrive/My Drive/[YCMI_CBDS Summer Course] Data/mimic_iii/MICROBIOLOGYEVENTS.csv")
admissions = pd.read_csv("/content/gdrive/My Drive/[YCMI_CBDS Summer Course] Data/mimic_iii/ADMISSIONS.csv")
proceedure_icd = pd.read_csv("/content/gdrive/My Drive/[YCMI_CBDS Summer Course] Data/mimic_iii/D_ICD_PROCEDURES.csv") 

#display the .head() of each csv to confirm it was imported properly
print(proceedure_events)
print(patients.head())
print(icu_stays.head())
print(microbiology_events.head())
print(admissions.head())
print(proceedure_icd.head())

     row_id  subject_id  hadm_id  seq_num  icd9_code
0      3994       10114   167957        1       3605
1      3995       10114   167957        2       3722
2      3996       10114   167957        3       8856
3      3997       10114   167957        4       9920
4      3998       10114   167957        5       9671
..      ...         ...      ...      ...        ...
501  230170       41976   179418        2       3893
502  235193       41976   155297        1       3893
503  235194       41976   155297        2        966
504  238588       41976   125013        1       3893
505  239961       41976   151798        1        966

[506 rows x 5 columns]
   row_id  subject_id  ...              dod_ssn expire_flag
0    9467       10006  ...  2165-08-12 00:00:00           1
1    9472       10011  ...                  NaN           1
2    9474       10013  ...  2125-10-07 00:00:00           1
3    9478       10017  ...  2152-09-12 00:00:00           1
4    9479       10019  ...  2163-05-15 00:00:00           1

[5 rows x 8 columns]
   row_id  subject_id  ...              outtime      los
0   12742       10006  ...  2164-10-25 12:21:07   1.6325
1   12747       10011  ...  2126-08-28 18:59:00  13.8507
2   12749       10013  ...  2125-10-07 15:13:52   2.6499
3   12754       10017  ...  2149-05-31 22:19:17   2.1436
4   12755       10019  ...  2163-05-16 03:47:04   1.2938

[5 rows x 12 columns]
   row_id  subject_id  ...  dilution_value interpretation
0  134694       10006  ...             NaN            NaN
1  134695       10006  ...             2.0              S
2  134696       10006  ...             1.0              S
3  134697       10006  ...             4.0              I
4  134698       10006  ...             4.0              R

[5 rows x 16 columns]
   row_id  subject_id  ...  hospital_expire_flag has_chartevents_data
0   12258       10006  ...                     0                    1
1   12263       10011  ...                     1                    1
2   12265       10013  ...                     1                    1
3   12269       10017  ...                     0                    1
4   12270       10019  ...                     1                    1

[5 rows x 19 columns]
   row_id  ...                                         long_title
0       1  ...  Destruction of chorioretinal lesion by xenon a...
1       2  ...  Destruction of chorioretinal lesion by laser p...
2       3  ...  Destruction of chorioretinal lesion by photoco...
3       4  ...  Destruction of chorioretinal lesion by radiati...
4       5  ...  Destruction of chorioretinal lesion by implant...

[5 rows x 4 columns]

In [0]:
#the following creates a list containing all of the dataframes we have read into our python project
mimic_csv_list = [proceedure_events, patients, icu_stays, microbiology_events, admissions, proceedure_icd]

#the following for loop prints every column name for each of our dataframes contained in the list created above. The empty print statement results in a blank space between 
#the lists of column names
for csv in mimic_csv_list: 
    for column_name in csv.columns:
      print(column_name)
    print()

row_id
subject_id
hadm_id
seq_num
icd9_code

row_id
subject_id
gender
dob
dod
dod_hosp
dod_ssn
expire_flag

row_id
subject_id
hadm_id
icustay_id
dbsource
first_careunit
last_careunit
first_wardid
last_wardid
intime
outtime
los

row_id
subject_id
hadm_id
chartdate
charttime
spec_itemid
spec_type_desc
org_itemid
org_name
isolate_num
ab_itemid
ab_name
dilution_text
dilution_comparison
dilution_value
interpretation

row_id
subject_id
hadm_id
admittime
dischtime
deathtime
admission_type
admission_location
discharge_location
insurance
language
religion
marital_status
ethnicity
edregtime
edouttime
diagnosis
hospital_expire_flag
has_chartevents_data

row_id
icd9_code
short_title
long_title

Next, the pandas .to_sql method statements below will add the data from these six dataframes to lecture.db database. Each dataframe will become a seperate table within the database.

In [0]:
proceedure_events.to_sql("proceedure_events", conn, if_exists="replace", index = False) #"proceedure_events" becomes the name of the table in the database. 
patients.to_sql("patients", conn, if_exists="replace", index = False) #conn is the cursor that points to the lecture.db.
icu_stays.to_sql("icu_stays", conn, if_exists="replace", index = False) #"index = false" indicates that there is no row headers or an index column in the dataframe.
microbiology_events.to_sql("microbiology_events", conn, if_exists="replace", index = False)
admissions.to_sql("admissions", conn, if_exists="replace", index = False)
proceedure_icd.to_sql("proceedure_icd", conn, if_exists = "replace", index = False)

## Exploring the MIMIC III Demo Database

### Quality Checking Considerations
* Who created this dataset originally?
* Does this dataset have any corrisponding documentation? 
* Are there any limitations on how this database can be used?

Find information on the MIMIC III database here: https://mimic.physionet.org/gettingstarted/demo/

### Data Management Considerations

Take time to look through the documentation associated with the mimic iii database. Understanding what data exists in a database is vital in order to form queries.

* Where is the data stored and in what format?
  * The csvs are stored in Google Drive, and mounted to our project a command used above
* What is included in the database? What is not included that you might expect to be included?
  * The database schema can be found here: https://mit-lcp.github.io/mimic-schema-spy/
* What is the structure of this database?
  * What are the names of each of the tables included in the database?
  * What data do the tables contain?
  * Each of the tables in this database has documentation about its contents: https://mimic.physionet.org/mimictables/admissions/

##### Return the names of each of the tables in the database

read_sql_query is a Pandas function that allows you to create SQL statements in Python. The SQL statement exists between quotation marks. 

The statement below selects the name column from the database metadata table, which is created automatically and is called sqlite_master. This allows us to see all of the table names in a database. If you did not have available database documentation, this is a strategy you could use to learn about which tables exist within a database.

In [0]:
pd.read_sql_query('SELECT name FROM sqlite_master WHERE type = "table";', conn) #pd.read_sql_query is the function, the first argument in the function is the SQL script, and the second
#argument is the conn variable, whichs connects the function to the database.

                  name
0    proceedure_events
1             patients
2            icu_stays
3  microbiology_events
4           admissions
5       proceedure_icd

##### Return the data types of each column within a table

Next, here are two ways to do the same task. The first uses the pandas .read_sql method, and the second uses a method from the sqlite3 library .fetchall.

Both use a cursor / conn method to point to and connect to the lecture.db database in order to look at the metadata contained in the sqlite_master file assocateed with the individual database table, "icu_stays".

Each provides the same data output, but in differing views. I point this out because data output can determine which function you may or may not want to use. In the output below, the sqlite3 output is more clear (because it is not truncated) than the pandas output. 

However, in this work book, we will rely on the pandas functions because when performing data subset queries, the output is easier to read. The code below results in a return that provides metadata about the data contained in the tables of the database.You can see that row_id is an integer, subject_id is an integer, first_careunit is text. So, we see the column name as well as the data type held within that column.

In [0]:
print("pandas output:", pd.read_sql_query('SELECT sql FROM sqlite_master WHERE type = "table" AND tbl_name = "icu_stays";', conn)) #this 
print() #prints a blank line
cursor.execute("select sql from sqlite_master where type = 'table' and tbl_name = 'icu_stays';") #establishes a sql query in quotation marks and connect this to the cursor 
print("sqlite3 output:", cursor.fetchall()) #this prints the result of what is gathered from the cursor execution

pandas output:                                                  sql
0  CREATE TABLE "icu_stays" (\n"row_id" INTEGER,\...

sqlite3 output: [('CREATE TABLE "icu_stays" (\n"row_id" INTEGER,\n  "subject_id" INTEGER,\n  "hadm_id" INTEGER,\n  "icustay_id" INTEGER,\n  "dbsource" TEXT,\n  "first_careunit" TEXT,\n  "last_careunit" TEXT,\n  "first_wardid" INTEGER,\n  "last_wardid" INTEGER,\n  "intime" TEXT,\n  "outtime" TEXT,\n  "los" REAL\n)',)]

## Pulling Data from the MIMIC III Demo Database (Single Table)

##### Pull all data from a single table using FROM and SELECT

The script below utilizes the sqlite3 library. This library attaches the SQL query to the database cursor with the execute function. The SQL function used is
"SELECT * FROM patients;".

"*" indicates that we want all of the records. "*" acts as a placeholder for "all". "patients" is the patient table name that was originally our csv files that was added to the lecture.db database.

In order to  read the output of this database call, which is stored in the variable "result." We would need to put result into a for loop. To avoid this extra step and because pandas output is easier to read in these instances, we will use the pandas read.sql function to see the results of the sql queries from here on out.

Briefly showing two different libraries that function similarly is a good reminder that not only does Python have libraries that perform the same tasks - but that these libraries think interact with and out put data in differing ways.

In [0]:
#print(pd.read_sql_query('SELECT * FROM PATIENTS', conn))
cursor.execute("SELECT * FROM patients;") #SQL code linked to the cursor
result = cursor.fetchall() 
for r in result:
  print(r)

(9467, 10006, 'F', '2094-03-05 00:00:00', '2165-08-12 00:00:00', '2165-08-12 00:00:00', '2165-08-12 00:00:00', 1)
(9472, 10011, 'F', '2090-06-05 00:00:00', '2126-08-28 00:00:00', '2126-08-28 00:00:00', None, 1)
(9474, 10013, 'F', '2038-09-03 00:00:00', '2125-10-07 00:00:00', '2125-10-07 00:00:00', '2125-10-07 00:00:00', 1)
(9478, 10017, 'F', '2075-09-21 00:00:00', '2152-09-12 00:00:00', None, '2152-09-12 00:00:00', 1)
(9479, 10019, 'M', '2114-06-20 00:00:00', '2163-05-15 00:00:00', '2163-05-15 00:00:00', '2163-05-15 00:00:00', 1)
(9486, 10026, 'F', '1895-05-17 00:00:00', '2195-11-24 00:00:00', None, '2195-11-24 00:00:00', 1)
(9487, 10027, 'F', '2108-01-15 00:00:00', '2190-09-14 00:00:00', None, '2190-09-14 00:00:00', 1)
(9489, 10029, 'M', '2061-04-10 00:00:00', '2140-09-21 00:00:00', None, '2140-09-21 00:00:00', 1)
(9491, 10032, 'M', '2050-03-29 00:00:00', '2138-05-21 00:00:00', '2138-05-21 00:00:00', '2138-05-21 00:00:00', 1)
(9492, 10033, 'F', '2051-04-21 00:00:00', '2133-09-09 00:00:00', None, '2133-09-09 00:00:00', 1)
(9494, 10035, 'M', '2053-04-13 00:00:00', '2133-03-30 00:00:00', None, '2133-03-30 00:00:00', 1)
(9495, 10036, 'F', '1885-03-24 00:00:00', '2185-03-26 00:00:00', '2185-03-26 00:00:00', '2185-03-26 00:00:00', 1)
(9497, 10038, 'F', '2056-01-27 00:00:00', '2147-03-17 00:00:00', '2147-03-17 00:00:00', '2147-03-17 00:00:00', 1)
(9499, 10040, 'F', '2061-10-23 00:00:00', '2150-09-05 00:00:00', '2150-09-05 00:00:00', '2150-09-05 00:00:00', 1)
(9501, 10042, 'M', '2076-05-06 00:00:00', '2150-12-03 00:00:00', None, '2150-12-03 00:00:00', 1)
(9502, 10043, 'M', '2109-04-07 00:00:00', '2191-02-07 00:00:00', None, '2191-02-07 00:00:00', 1)
(9503, 10044, 'F', '2071-02-11 00:00:00', '2152-10-20 00:00:00', '2152-10-20 00:00:00', '2152-10-20 00:00:00', 1)
(9504, 10045, 'F', '2061-03-25 00:00:00', '2129-12-01 00:00:00', '2129-12-01 00:00:00', '2129-12-01 00:00:00', 1)
(9505, 10046, 'F', '2141-03-15 00:00:00', '2195-03-13 00:00:00', None, '2195-03-13 00:00:00', 1)
(9514, 10056, 'F', '2046-02-27 00:00:00', '2129-09-16 00:00:00', None, '2129-09-16 00:00:00', 1)
(9517, 10059, 'M', '2081-01-03 00:00:00', '2150-08-29 00:00:00', '2150-08-29 00:00:00', '2150-08-29 00:00:00', 1)
(9519, 10061, 'F', '2031-05-19 00:00:00', '2108-04-03 00:00:00', None, '2108-04-03 00:00:00', 1)
(9522, 10064, 'M', '2058-04-23 00:00:00', '2127-03-19 00:00:00', '2127-03-19 00:00:00', None, 1)
(9523, 10065, 'F', '2111-07-18 00:00:00', '2193-11-06 00:00:00', '2193-11-06 00:00:00', '2193-11-06 00:00:00', 1)
(9525, 10067, 'M', '2101-06-10 00:00:00', '2130-10-06 00:00:00', '2130-10-06 00:00:00', None, 1)
(9527, 10069, 'F', '2146-10-23 00:00:00', '2188-02-27 00:00:00', '2188-02-27 00:00:00', '2188-02-27 00:00:00', 1)
(9531, 10074, 'M', '2081-12-26 00:00:00', '2167-04-24 00:00:00', None, '2167-04-24 00:00:00', 1)
(9533, 10076, 'M', '2038-05-10 00:00:00', '2107-03-30 00:00:00', '2107-03-30 00:00:00', '2107-03-30 00:00:00', 1)
(9539, 10083, 'F', '2110-03-25 00:00:00', '2192-12-12 00:00:00', None, '2192-12-12 00:00:00', 1)
(9544, 10088, 'M', '2029-07-09 00:00:00', '2107-07-20 00:00:00', None, '2107-07-20 00:00:00', 1)
(9545, 10089, 'M', '2046-04-18 00:00:00', '2132-08-08 00:00:00', '2132-08-08 00:00:00', '2132-08-08 00:00:00', 1)
(9546, 10090, 'M', '2096-02-27 00:00:00', '2126-04-06 00:00:00', None, '2126-04-06 00:00:00', 1)
(9549, 10093, 'M', '2053-09-08 00:00:00', '2141-01-26 00:00:00', '2141-01-26 00:00:00', '2141-01-26 00:00:00', 1)
(9550, 10094, 'M', '1880-02-29 00:00:00', '2180-03-20 00:00:00', '2180-03-20 00:00:00', '2180-03-20 00:00:00', 1)
(9553, 10098, 'F', '2150-12-07 00:00:00', '2170-12-03 00:00:00', '2170-12-03 00:00:00', None, 1)
(9556, 10101, 'M', '2055-07-18 00:00:00', '2128-03-24 00:00:00', '2128-03-24 00:00:00', None, 1)
(9557, 10102, 'M', '2035-04-13 00:00:00', '2105-06-11 00:00:00', '2105-06-11 00:00:00', '2105-06-11 00:00:00', 1)
(9559, 10104, 'F', '2050-02-16 00:00:00', '2125-05-09 00:00:00', None, '2125-05-09 00:00:00', 1)
(9561, 10106, 'M', '2097-12-16 00:00:00', '2163-09-15 00:00:00', None, '2163-09-15 00:00:00', 1)
(9566, 10111, 'F', '2097-01-16 00:00:00', '2180-02-01 00:00:00', '2180-02-01 00:00:00', '2180-02-01 00:00:00', 1)
(9567, 10112, 'F', '2069-05-05 00:00:00', '2148-01-19 00:00:00', '2148-01-19 00:00:00', '2148-01-19 00:00:00', 1)
(9569, 10114, 'F', '2099-03-17 00:00:00', '2178-05-02 00:00:00', '2178-05-02 00:00:00', '2178-05-02 00:00:00', 1)
(9572, 10117, 'F', '2072-05-05 00:00:00', '2138-11-18 00:00:00', '2138-11-18 00:00:00', None, 1)
(9574, 10119, 'M', '2036-03-10 00:00:00', '2120-09-18 00:00:00', None, '2120-09-18 00:00:00', 1)
(9575, 10120, 'M', '2088-05-05 00:00:00', '2115-05-15 00:00:00', '2115-05-15 00:00:00', None, 1)
(9579, 10124, 'F', '2108-12-20 00:00:00', '2192-05-15 00:00:00', '2192-05-15 00:00:00', '2192-05-15 00:00:00', 1)
(9581, 10126, 'F', '2127-06-04 00:00:00', '2171-08-16 00:00:00', '2171-08-16 00:00:00', '2171-08-16 00:00:00', 1)
(9582, 10127, 'F', '2181-04-19 00:00:00', '2201-11-08 00:00:00', None, '2201-11-08 00:00:00', 1)
(9585, 10130, 'M', '2109-07-08 00:00:00', '2161-03-13 00:00:00', '2161-03-13 00:00:00', '2161-03-13 00:00:00', 1)
(9587, 10132, 'F', '2058-04-23 00:00:00', '2123-11-06 00:00:00', '2123-11-06 00:00:00', '2123-11-06 00:00:00', 1)
(30831, 40124, 'F', '2063-07-05 00:00:00', '2130-11-03 00:00:00', '2130-11-03 00:00:00', '2130-11-03 00:00:00', 1)
(30839, 40177, 'M', '2082-06-27 00:00:00', '2169-05-12 00:00:00', '2169-05-12 00:00:00', None, 1)
(30848, 40204, 'M', '2079-08-17 00:00:00', '2156-02-08 00:00:00', '2156-02-08 00:00:00', '2156-02-08 00:00:00', 1)
(30865, 40277, 'F', '2070-10-11 00:00:00', '2154-01-22 00:00:00', None, '2154-01-22 00:00:00', 1)
(30866, 40286, 'F', '2110-04-02 00:00:00', '2196-10-22 00:00:00', None, '2196-10-22 00:00:00', 1)
(30873, 40304, 'M', '2086-12-16 00:00:00', '2165-01-17 00:00:00', '2165-01-17 00:00:00', '2165-01-17 00:00:00', 1)
(30876, 40310, 'M', '2103-12-05 00:00:00', '2144-12-31 00:00:00', '2144-12-31 00:00:00', None, 1)
(30908, 40456, 'F', '2031-08-12 00:00:00', '2120-08-13 00:00:00', None, '2120-08-13 00:00:00', 1)
(30924, 40503, 'F', '2097-11-14 00:00:00', '2186-07-07 00:00:00', '2186-07-07 00:00:00', None, 1)
(30946, 40595, 'F', '2068-03-04 00:00:00', '2144-10-31 00:00:00', '2144-10-31 00:00:00', '2144-10-31 00:00:00', 1)
(30950, 40601, 'F', '2112-01-20 00:00:00', '2184-08-26 00:00:00', None, '2184-08-26 00:00:00', 1)
(30954, 40612, 'F', '2073-08-13 00:00:00', '2159-11-25 00:00:00', None, '2159-11-25 00:00:00', 1)
(30962, 40655, 'F', '1844-07-18 00:00:00', '2145-03-07 00:00:00', '2145-03-07 00:00:00', None, 1)
(30968, 40687, 'F', '2073-06-05 00:00:00', '2155-03-12 00:00:00', '2155-03-12 00:00:00', '2155-03-12 00:00:00', 1)
(31277, 41795, 'M', '2096-07-25 00:00:00', '2145-12-06 00:00:00', None, '2145-12-06 00:00:00', 1)
(31300, 41914, 'M', '2090-11-16 00:00:00', '2146-01-25 00:00:00', '2146-01-25 00:00:00', '2146-01-25 00:00:00', 1)
(31311, 41976, 'M', '2136-07-28 00:00:00', '2202-12-05 00:00:00', None, '2202-12-05 00:00:00', 1)
(31314, 41983, 'F', '1851-09-12 00:00:00', '2151-09-15 00:00:00', '2151-09-15 00:00:00', None, 1)
(31323, 42033, 'F', '2045-10-07 00:00:00', '2131-07-28 00:00:00', '2131-07-28 00:00:00', None, 1)
(31332, 42066, 'M', '2061-06-13 00:00:00', '2112-02-11 00:00:00', '2112-02-11 00:00:00', None, 1)
(31337, 42075, 'M', '2086-02-04 00:00:00', '2166-02-26 00:00:00', '2166-02-26 00:00:00', '2166-02-26 00:00:00', 1)
(31350, 42135, 'M', '2083-09-20 00:00:00', '2127-10-28 00:00:00', '2127-10-28 00:00:00', '2127-10-28 00:00:00', 1)
(31372, 42199, 'F', '2044-06-27 00:00:00', '2117-04-04 00:00:00', '2117-04-04 00:00:00', None, 1)
(31379, 42231, 'F', '2016-12-05 00:00:00', '2105-05-18 00:00:00', '2105-05-18 00:00:00', '2103-05-18 00:00:00', 1)
(31391, 42275, 'M', '2058-08-04 00:00:00', '2136-03-26 00:00:00', '2136-03-26 00:00:00', None, 1)
(31392, 42281, 'F', '2051-03-23 00:00:00', '2119-11-14 00:00:00', '2119-11-14 00:00:00', '2119-11-14 00:00:00', 1)
(31395, 42292, 'M', '2098-04-29 00:00:00', '2165-01-16 00:00:00', None, '2165-01-16 00:00:00', 1)
(31397, 42302, 'F', '2074-09-29 00:00:00', '2160-06-08 00:00:00', None, '2160-06-08 00:00:00', 1)
(31401, 42321, 'F', '2041-05-16 00:00:00', '2122-02-28 00:00:00', '2122-02-28 00:00:00', '2122-02-28 00:00:00', 1)
(31406, 42346, 'F', '2072-12-03 00:00:00', '2160-12-27 00:00:00', '2160-12-27 00:00:00', '2160-12-27 00:00:00', 1)
(31413, 42367, 'F', '2060-02-12 00:00:00', '2147-11-04 00:00:00', '2147-11-04 00:00:00', '2147-11-04 00:00:00', 1)
(31427, 42412, 'M', '2079-01-29 00:00:00', '2166-05-30 00:00:00', '2166-05-30 00:00:00', None, 1)
(31429, 42430, 'M', '2061-12-10 00:00:00', '2142-11-30 00:00:00', '2142-11-30 00:00:00', '2142-11-30 00:00:00', 1)
(31440, 42458, 'M', '1846-07-21 00:00:00', '2147-09-08 00:00:00', '2147-09-08 00:00:00', None, 1)
(31752, 43735, 'M', '2046-07-05 00:00:00', '2128-11-09 00:00:00', '2128-11-09 00:00:00', None, 1)
(31758, 43746, 'F', '2029-12-07 00:00:00', '2111-01-14 00:00:00', '2111-01-14 00:00:00', None, 1)
(31759, 43748, 'M', '2099-09-02 00:00:00', '2181-02-27 00:00:00', '2181-02-27 00:00:00', '2181-02-27 00:00:00', 1)
(31765, 43779, 'M', '2097-01-07 00:00:00', '2173-12-24 00:00:00', None, '2173-12-24 00:00:00', 1)
(31771, 43798, 'M', '2136-07-29 00:00:00', '2200-12-31 00:00:00', '2200-12-31 00:00:00', '2200-12-31 00:00:00', 1)
(31778, 43827, 'F', '1876-07-14 00:00:00', '2178-12-07 00:00:00', '2178-12-07 00:00:00', '2178-12-07 00:00:00', 1)
(31784, 43870, 'F', '2097-05-16 00:00:00', '2186-02-12 00:00:00', '2186-02-12 00:00:00', '2186-02-12 00:00:00', 1)
(31789, 43879, 'F', '2051-07-25 00:00:00', '2107-07-13 00:00:00', '2107-07-13 00:00:00', None, 1)
(31790, 43881, 'M', '2051-03-24 00:00:00', '2105-02-16 00:00:00', '2105-02-16 00:00:00', '2105-02-16 00:00:00', 1)
(31794, 43909, 'F', '2073-11-22 00:00:00', '2152-10-09 00:00:00', '2152-10-09 00:00:00', '2152-10-09 00:00:00', 1)
(31800, 43927, 'F', '2104-02-12 00:00:00', '2176-09-09 00:00:00', '2176-09-09 00:00:00', '2176-09-09 00:00:00', 1)
(31838, 44083, 'M', '2057-11-15 00:00:00', '2114-02-20 00:00:00', '2114-02-20 00:00:00', '2114-02-20 00:00:00', 1)
(31853, 44154, 'M', '1878-05-14 00:00:00', '2178-05-15 00:00:00', '2178-05-15 00:00:00', '2178-05-15 00:00:00', 1)
(31867, 44212, 'F', '2078-06-16 00:00:00', '2124-01-29 00:00:00', None, '2124-01-29 00:00:00', 1)
(31870, 44222, 'M', '2107-06-27 00:00:00', '2182-08-03 00:00:00', '2182-08-03 00:00:00', None, 1)
(31872, 44228, 'F', '2112-10-22 00:00:00', '2171-04-14 00:00:00', '2171-04-14 00:00:00', None, 1)

##### Pull specific columns from a table using FROM and SELECT

This is a pandas based SQL query for comparison. Though in this query, specific columns (subject_id, gender, dob, and dod_hosp) are requested from the patients table, rather than all of the columns from this table.

In [0]:
pd.read_sql_query(
    '''SELECT subject_id, gender, dob, dod_hosp 
    FROM patients;''',
    conn) # conn, here, connects this query to the database rather than the cursor. 
    #The cursor is built in to the pandas function, so we do not need the extra specification, as is needed with the sqlite3 library.

    subject_id gender                  dob             dod_hosp
0        10006      F  2094-03-05 00:00:00  2165-08-12 00:00:00
1        10011      F  2090-06-05 00:00:00  2126-08-28 00:00:00
2        10013      F  2038-09-03 00:00:00  2125-10-07 00:00:00
3        10017      F  2075-09-21 00:00:00                 None
4        10019      M  2114-06-20 00:00:00  2163-05-15 00:00:00
..         ...    ...                  ...                  ...
95       44083      M  2057-11-15 00:00:00  2114-02-20 00:00:00
96       44154      M  1878-05-14 00:00:00  2178-05-15 00:00:00
97       44212      F  2078-06-16 00:00:00                 None
98       44222      M  2107-06-27 00:00:00  2182-08-03 00:00:00
99       44228      F  2112-10-22 00:00:00  2171-04-14 00:00:00

[100 rows x 4 columns]

##### Pull data based on specified parameters from a single table using the WHERE clause

WHERE clause operators include:


*   = : equal
*   \> : greater than
*   < : less than
*   \>= : greater than or equal
*   <= : less than or equal
*   <> or != : not equal
*   BETWEEN : between a certain range
*   LIKE : search for a pattern (%pattern string%)
*   IN : speficic value pattern

These allow you to call data based on a value. Maybe you want a particilar time or age range, or maybe you want to include only a certain insurance type.

##### This query will return the columns subject_id, insurance, diagnosis, and admission_location from the admissions table, including only rows that have SEPSIS as the value within the diagnosis column.

In [0]:
pd.read_sql_query('''SELECT subject_id, insurance, diagnosis, admission_location FROM admissions WHERE diagnosis = "SEPSIS";''',conn)

   subject_id insurance diagnosis         admission_location
0       10006  Medicare    SEPSIS       EMERGENCY ROOM ADMIT
1       10013  Medicare    SEPSIS  TRANSFER FROM HOSP/EXTRAM
2       10036  Medicare    SEPSIS       EMERGENCY ROOM ADMIT
3       10056  Medicare    SEPSIS  TRANSFER FROM HOSP/EXTRAM
4       40601   Private    SEPSIS       EMERGENCY ROOM ADMIT
5       41976  Medicare    SEPSIS       EMERGENCY ROOM ADMIT
6       41976  Medicare    SEPSIS  CLINIC REFERRAL/PREMATURE
7       41976  Medicare    SEPSIS  CLINIC REFERRAL/PREMATURE
8       41976  Medicare    SEPSIS  CLINIC REFERRAL/PREMATURE
9       41976  Medicare    SEPSIS  CLINIC REFERRAL/PREMATURE

##### This query will return the same columns as above, but with less exact parameters

Using LIKE instead of =, and adding "%" around our string SEPSIS, allows us to see SEPSIS + other strings.

In [0]:
pd.read_sql_query('SELECT subject_id, insurance, diagnosis, admission_location FROM admissions WHERE diagnosis LIKE "%SEPSIS%";',conn)

    subject_id insurance                   diagnosis         admission_location
0        10006  Medicare                      SEPSIS       EMERGENCY ROOM ADMIT
1        10013  Medicare                      SEPSIS  TRANSFER FROM HOSP/EXTRAM
2        10036  Medicare                      SEPSIS       EMERGENCY ROOM ADMIT
3        10056  Medicare                      SEPSIS  TRANSFER FROM HOSP/EXTRAM
4        10088  Medicare  SEPSIS;PNEUMONIA;TELEMETRY       EMERGENCY ROOM ADMIT
5        10088   Private                   UROSEPSIS  TRANSFER FROM HOSP/EXTRAM
6        10094  Medicare            SEPSIS;TELEMETRY       EMERGENCY ROOM ADMIT
7        40601   Private                      SEPSIS       EMERGENCY ROOM ADMIT
8        41976  Medicare                      SEPSIS       EMERGENCY ROOM ADMIT
9        41976  Medicare                      SEPSIS  CLINIC REFERRAL/PREMATURE
10       41976  Medicare                      SEPSIS  CLINIC REFERRAL/PREMATURE
11       41976  Medicare                 SEPSIS; UTI  CLINIC REFERRAL/PREMATURE
12       41976  Medicare                      SEPSIS  CLINIC REFERRAL/PREMATURE
13       41976  Medicare                      SEPSIS  CLINIC REFERRAL/PREMATURE

##### Pull data based on multiple parameters

You can multiple conditional parameters by adding AND or OR between them. The query below returns specified columns from the microbiology_events table, where rows contain either BLOOD CULTURE as the spec_type_desc AND a dilution_value greater than or equal to 6.

In [0]:
pd.read_sql_query('SELECT row_id, spec_itemid, dilution_value, org_name FROM microbiology_events WHERE spec_type_desc = "BLOOD CULTURE" AND dilution_value >= 6;', conn)

    row_id  spec_itemid  dilution_value                            org_name
0   134700        70012             8.0  STAPHYLOCOCCUS, COAGULASE NEGATIVE
1   134802        70012             8.0         GRAM POSITIVE COCCUS(COCCI)
2   134885        70012            32.0                    ESCHERICHIA COLI
3   134887        70012             8.0                    ESCHERICHIA COLI
4   134888        70012            16.0                    ESCHERICHIA COLI
5   134896        70012             8.0                    ENTEROCOCCUS SP.
6   134897        70012            16.0                    ENTEROCOCCUS SP.
7   135478        70012             8.0  STAPHYLOCOCCUS, COAGULASE NEGATIVE
8   135479        70012            16.0  STAPHYLOCOCCUS, COAGULASE NEGATIVE
9   135484        70012             8.0  STAPHYLOCOCCUS, COAGULASE NEGATIVE
10  135497        70012            32.0                ENTEROCOCCUS FAECIUM
11  135500        70012            32.0                ENTEROCOCCUS FAECIUM
12  135959        70012             8.0                 STAPH AUREUS COAG +
13  135962        70012             8.0                 STAPH AUREUS COAG +
14  135963        70012             8.0                 STAPH AUREUS COAG +
15  136011        70012             8.0  STAPHYLOCOCCUS, COAGULASE NEGATIVE
16  136017        70012             8.0  STAPHYLOCOCCUS, COAGULASE NEGATIVE
17  136018        70012             8.0  STAPHYLOCOCCUS, COAGULASE NEGATIVE
18  432272        70012             8.0                   PROTEUS MIRABILIS
19  432273        70012            16.0                   PROTEUS MIRABILIS
20  432274        70012             8.0                   PROTEUS MIRABILIS
21  432278        70012            32.0                   PROTEUS MIRABILIS
22  432279        70012            32.0                   PROTEUS MIRABILIS
23  433264        70012             8.0               KLEBSIELLA PNEUMONIAE
24  439843        70012           128.0                    ESCHERICHIA COLI
25  439844        70012            16.0                    ESCHERICHIA COLI
26  439845        70012            16.0                    ESCHERICHIA COLI
27  439850        70012            16.0                    ESCHERICHIA COLI
28  439852        70012            32.0                    ESCHERICHIA COLI
29  439854        70012            16.0                    ESCHERICHIA COLI

##### Find distinct data occurances with DISTINCT

This will return unique values from a column. This can be a quick way to see all of the categories represented in a dataset.

In [0]:
pd.read_sql_query('SELECT DISTINCT admission_type FROM admissions;', conn)
pd.read_sql_query('SELECT DISTINCT admission_location FROM admissions;', conn)

          admission_location
0       EMERGENCY ROOM ADMIT
1  TRANSFER FROM HOSP/EXTRAM
2  PHYS REFERRAL/NORMAL DELI
3  CLINIC REFERRAL/PREMATURE
4  TRANSFER FROM SKILLED NUR

##### Show ordered resulting data

Now that the SQL queries are getting longer, I will start breaking them up into multiple lines by enclosing the statement in 3 single quotes (seen below). 

The query below returns selected columns from the admissions table oreded by admission type (ascending), and admission_location (decending).

In [0]:
pd.read_sql_query('''SELECT subject_id, admission_type, admission_location, admittime 
FROM admissions 
ORDER BY admission_type ASC, admission_location DESC;''', conn)

     subject_id admission_type         admission_location            admittime
0         42231       ELECTIVE  PHYS REFERRAL/NORMAL DELI  2102-08-29 07:15:00
1         44083       ELECTIVE  PHYS REFERRAL/NORMAL DELI  2112-05-04 08:00:00
2         10035       ELECTIVE  PHYS REFERRAL/NORMAL DELI  2129-03-03 16:06:00
3         43927       ELECTIVE  PHYS REFERRAL/NORMAL DELI  2175-10-02 12:30:00
4         10065       ELECTIVE  PHYS REFERRAL/NORMAL DELI  2189-09-08 07:15:00
..          ...            ...                        ...                  ...
124       41976      EMERGENCY  CLINIC REFERRAL/PREMATURE  2202-02-15 19:01:00
125       41976      EMERGENCY  CLINIC REFERRAL/PREMATURE  2202-09-16 21:56:00
126       41976      EMERGENCY  CLINIC REFERRAL/PREMATURE  2202-10-03 01:45:00
127       10112         URGENT  TRANSFER FROM HOSP/EXTRAM  2148-01-13 22:32:00
128       10114         URGENT  TRANSFER FROM HOSP/EXTRAM  2171-10-30 19:03:00

[129 rows x 4 columns]

## Pulling Data from the MIMIC III Demo Database (Multiple Tables), i.e. Joining

Joins in SQL are used to combine columns from two or more tables, based on shared columns containing elements to link (or join) by.

View an interactive visualization of join components here: https://joins.spathon.com/

This next query will return subject_ids from the patients table (patients.subject_id), date of birth, insurance, marital_status FROM the patients table and the admissions table - JOINing these tables together by the subject_id column.

Because subject_id appears in both the paitients table and the admissions table, we can JOIN these tables together. Also, because subject_id appears in both tables, we need to specify which column we want SELECTed by indicating tablename.subject_id (patients.subject_id below). 

The ON specification in the query below establishes this linking value.

In [0]:
#Pull together subject date of birth (from the patients table) with insurance and marital statuses (from admissions table)
pd.read_sql_query('''SELECT patients.subject_id, dob, insurance, marital_status 
FROM patients 
INNER JOIN admissions 
ON patients.subject_id = admissions.subject_id;''', conn)

     subject_id                  dob insurance marital_status
0         10006  2094-03-05 00:00:00  Medicare      SEPARATED
1         10011  2090-06-05 00:00:00   Private         SINGLE
2         10013  2038-09-03 00:00:00  Medicare           None
3         10017  2075-09-21 00:00:00  Medicare       DIVORCED
4         10019  2114-06-20 00:00:00  Medicare       DIVORCED
..          ...                  ...       ...            ...
124       44083  2057-11-15 00:00:00   Private         SINGLE
125       44154  1878-05-14 00:00:00  Medicare        MARRIED
126       44212  2078-06-16 00:00:00  Medicare         SINGLE
127       44222  2107-06-27 00:00:00  Medicare         SINGLE
128       44228  2112-10-22 00:00:00   Private         SINGLE

[129 rows x 4 columns]

##### Conditional parameters can still be applied when using JOINed databases

The statement below is almost exactly the same as the statement above. The only difference is that only subjects who are denoted as WIDOWED or SINGLE in the marital_status column are included.

In [0]:
#Refine the query above by only including subjects who are either single or widowed
pd.read_sql_query('''SELECT patients.subject_id, marital_status, dob, insurance 
FROM patients INNER JOIN admissions 
ON patients.subject_id = admissions.subject_id 
WHERE marital_status = "WIDOWED" OR marital_status = "SINGLE";''', conn)

    subject_id marital_status                  dob insurance
0        10011         SINGLE  2090-06-05 00:00:00   Private
1        10032        WIDOWED  2050-03-29 00:00:00  Medicare
2        10038        WIDOWED  2056-01-27 00:00:00  Medicare
3        10046         SINGLE  2141-03-15 00:00:00  Medicaid
4        10061        WIDOWED  2031-05-19 00:00:00  Medicare
5        10065         SINGLE  2111-07-18 00:00:00   Private
6        10090         SINGLE  2096-02-27 00:00:00   Private
7        10093        WIDOWED  2053-09-08 00:00:00  Medicare
8        10111        WIDOWED  2097-01-16 00:00:00  Medicare
9        10117         SINGLE  2072-05-05 00:00:00   Private
10       10117         SINGLE  2072-05-05 00:00:00   Private
11       10120         SINGLE  2088-05-05 00:00:00  Medicaid
12       10124        WIDOWED  2108-12-20 00:00:00  Medicare
13       10124        WIDOWED  2108-12-20 00:00:00  Medicare
14       10126         SINGLE  2127-06-04 00:00:00   Private
15       40124         SINGLE  2063-07-05 00:00:00  Medicare
16       40124         SINGLE  2063-07-05 00:00:00  Medicare
17       40277        WIDOWED  2070-10-11 00:00:00  Medicare
18       40310         SINGLE  2103-12-05 00:00:00   Private
19       40310         SINGLE  2103-12-05 00:00:00  Medicaid
20       40456        WIDOWED  2031-08-12 00:00:00  Medicare
21       40612         SINGLE  2073-08-13 00:00:00  Medicare
22       40655        WIDOWED  1844-07-18 00:00:00  Medicare
23       40687        WIDOWED  2073-06-05 00:00:00  Medicare
24       42066         SINGLE  2061-06-13 00:00:00   Private
25       42075        WIDOWED  2086-02-04 00:00:00  Medicare
26       42281         SINGLE  2051-03-23 00:00:00  Medicare
27       42292         SINGLE  2098-04-29 00:00:00   Private
28       42302         SINGLE  2074-09-29 00:00:00  Medicare
29       42321        WIDOWED  2041-05-16 00:00:00  Medicare
30       42346         SINGLE  2072-12-03 00:00:00  Medicare
31       42346         SINGLE  2072-12-03 00:00:00  Medicare
32       43746        WIDOWED  2029-12-07 00:00:00  Medicare
33       43827         SINGLE  1876-07-14 00:00:00  Medicare
34       43927        WIDOWED  2104-02-12 00:00:00  Medicare
35       44083         SINGLE  2057-11-15 00:00:00   Private
36       44083         SINGLE  2057-11-15 00:00:00   Private
37       44083         SINGLE  2057-11-15 00:00:00   Private
38       44212         SINGLE  2078-06-16 00:00:00  Medicare
39       44222         SINGLE  2107-06-27 00:00:00  Medicare
40       44228         SINGLE  2112-10-22 00:00:00   Private

##### Left Joins: Add relevant columns to your primary (left) spreadsheet from secondary spreadsheets, while keeping rows in the primary spreadsheet which have no linked values from the secondary spreadsheets.

The example below contains two LEFT JOINs. Since proceedures are listed individually in the proceedure_events table (each subject may have 0, 1 or more proceedures per admission), and actual proceedure titles are listed in the proceedures_icd table, in order to work across all three tables, you will need to perform the two joins shown below.

The result below pulls together data from the admissions tables and the proceedures_icd table, using the proceedure_events table as a sort of cross-walk between the tables.

In [0]:
#perform a left join to link proceedure names in the proceedure_icds to the icd codes present 
#in the proceedure_events table, and present these proceedure names with specific admission instances.

pd.read_sql_query('''SELECT admissions.subject_id, discharge_location, proceedure_icd.short_title 
FROM admissions 
LEFT JOIN proceedure_events ON admissions.subject_id = proceedure_events.subject_id
LEFT JOIN proceedure_icd ON proceedure_events.icd9_code = proceedure_icd.icd9_code;''', conn)

      subject_id        discharge_location               short_title
0          10006          HOME HEALTH CARE   Injection oxazolidinone
1          10006          HOME HEALTH CARE           Venous cath NEC
2          10006          HOME HEALTH CARE   Ven cath renal dialysis
3          10006          HOME HEALTH CARE              Hemodialysis
4          10006          HOME HEALTH CARE  Percu abdominal drainage
...          ...                       ...                       ...
1331       44212  REHAB/DISTINCT PART HOSP  Cont inv mec ven 96+ hrs
1332       44222                      HOME                      None
1333       44228          HOME HEALTH CARE           Venous cath NEC
1334       44228          HOME HEALTH CARE           Venous cath NEC
1335       44228          HOME HEALTH CARE   Packed cell transfusion

[1336 rows x 3 columns]

##### Let's look at this a bit more closely

First, by viewing the proceedure_events table and observing where the icd9_codes, icd short_titles, and discharge appear across the dataframes.

In [0]:
print(proceedure_events.head())
print(proceedure_icd.head())
print(admissions.head())

     icd9_code
0         3605
1         3722
2         8856
3         9920
4         9671
..         ...
501       3893
502       3893
503        966
504       3893
505        966

[506 rows x 1 columns]
   row_id  subject_id  hadm_id  seq_num  icd9_code
0    3994       10114   167957        1       3605
1    3995       10114   167957        2       3722
2    3996       10114   167957        3       8856
3    3997       10114   167957        4       9920
4    3998       10114   167957        5       9671

##### Summarizing data results using COUNT and GROUP BY

You can use a COUNT function to create a summary read out if you also determine what you would like to GROUP BY. Below, you can see how if you GROUP BY subject_id, you are then able to COUNT the number of icd9_codes per each of these subject_ids within the proceedure_events column. This essentially tells us that for each subject indexed in the, how many proceedures the subject has undergone.

Since COUNT is now one of our columns in this data pull, we can utilize apply a conditional statement to this column. HAVING allows us to filter on this summary column. Below, only patientes who have had more than 15 proceedures are included in the final results.

In [0]:
pd.read_sql_query('''SELECT subject_id, COUNT(icd9_code) 
FROM proceedure_events
GROUP BY subject_id
HAVING COUNT(icd9_code) > 15 ''', conn)

   subject_id  COUNT(icd9_code)
0       10126                22
1       10127                19
2       40310                18
3       41976                49
4       42075                16

In this last example, you can see how you can bring all of the SQL query elements together to built out highly customizable database queries. Below, this query provides the names of proceedure events that have occured in the database more than 10 times by bringing together the proceedure_icd and proceedure_events tables with a left join.

In [0]:
pd.read_sql_query('''SELECT proceedure_icd.short_title, proceedure_events.icd9_code, COUNT(proceedure_events.icd9_code) 
FROM proceedure_events
LEFT JOIN proceedure_icd on proceedure_events.icd9_code = proceedure_icd.icd9_code
GROUP BY proceedure_events.icd9_code
HAVING COUNT(proceedure_events.icd9_code) > 10;''', conn)

                short_title  icd9_code  COUNT(proceedure_events.icd9_code)
0   Entral infus nutrit sub        966                                  32
1           Venous cath NEC       3893                                  56
2  Percu abdominal drainage       5491                                  12
3  Insert endotracheal tube       9604                                  22
4  Cont inv mec ven <96 hrs       9671                                  21
5  Cont inv mec ven 96+ hrs       9672                                  19
6   Packed cell transfusion       9904                                  30
7   Parent infus nutrit sub       9915                                  14

## Overview: Bringing SQL Query Elements Together

In order to build out more complex single queries in SQL, you will follow the structure below. To generalize the theme of this structure: SQL queries startby pointing at relevant columns and tables (lines 1 through 4 below), specifying (cell) values of interest (line 5 below), and finally choosing how the data is returned (lines 6 through 7).

As we saw in the SQL in previous examples, lines 3 through 7 in the code snippet below are optional and they are included in a query, they are also expandable. 

```
1. SELECT column_name
2. FROM table1_name
3.     JOIN table2_name
4.       ON table1_name.linking_column_name = table2_name.linking_column_name
5.     WHERE contraint_expression
6.     GROUP BY column_name
7.     ORDER BY column_name ASC/DESC
```

As you work through the exercises for this session, revisit the database documentation links provided in this lecture workbook. Think about other questions you can ask of the mimic iii database and piece together a SQL query that will result in you retreving data that will enabe you to answer your question.